Revit 2024 API
BuiltInFailures.SketchFailures.InvalidSketchForCeiling Property
 Ceiling sketch is invalid.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidSketchForCeiling { get; }
Visual Basic
Public Shared ReadOnly Property InvalidSketchForCeiling As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidSketchForCeiling {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace